export const AgreementData = {
  updatedAt: '23/03/01',
  agreementContent: `**개인정보처리방침 내용 작성**
    
    💡 *< 멋쟁이사자처럼 명지대(자연)>(*은(는) 「개인정보 보호법」 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립·공개합니다.


    ○ 이 개인정보처리방침은 ***2023년 3월 1일*** 부터 적용됩니다.
    
    **제1조(개인정보의 처리 목적)**
    
    ***< 멋쟁이사자처럼 명지대(자연) >*은(는) 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며 이용 목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.**
    
    1. 지원 프로세스 관리를 위한 개인정보 열람
    
    본 동아리 지원 의사 확인, 지원관리에 따른 본인 식별·인증, 지원자 자격 유지·관리, 고충처리(CS) 목적으로 개인정보를 처리합니다.
    
    2. 민원사무 처리
    
    민원인의 신원 확인, 민원사항 확인, 처리결과 통보 목적으로 개인정보를 처리합니다.
    
    3. 재화 또는 서비스 제공
    
    서비스 제공, 콘텐츠 제공, 맞춤서비스 제공, 본인인증을 목적으로 개인정보를 처리합니다.
    
    4. 마케팅 및 광고에의 활용
    
    신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공 , 인구통계학적 특성에 따른 서비스 제공 및 광고 게재 , 서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.
    
    **동의를 거부할 권리 및 동의를 거부할 경우의 불이익**
    
    위 제3자에 대한 개인 정보의 제공에 관한 동의를 거부할 수 있으나 본 프로그램 참가를 위해 필수적이므로 위 사항에 동의하셔야만 참가 및 활동이 가능합니다.
    
    **제2조(개인정보의 처리 및 보유 기간)**
    
    ① *< **멋쟁이사자처럼 명지대(자연)** >*은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.
    
    ② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
    
    1.<지원 프로세스 관리를 위한 개인정보 열람>
    
    <지원 프로세스 관리를 위한 개인정보 열람> 과 관련한 개인정보는 수집.이용에 관한 동의일로부터 <1년> 까지 위 이용목적을 위하여 보유.이용됩니다.
    
    보유근거 : 지원자 정보 관리 및 합불 여부 통지
    
    관련법령 : 1)신용정보의 수집/처리 및 이용 등에 관한 기록 : 3년
    
    2) 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
    
    3) 표시/광고에 관한 기록 : 6개월
    
    **제3조(정보주체와 법정대리인의 권리·의무 및 그 행사방법)**
    
    ① 정보주체는 ***멋쟁이사자처럼 명지대(자연)***에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다.
    
    ② 제1항에 따른 권리 행사는 ***멋쟁이사자처럼 명지대(자연)*** 에 대해 「개인정보 보호법」 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 ***멋쟁이사자처럼 명지대(자연)***  은(는) 이에 대해 지체 없이 조치하겠습니다.
    
    ③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다.이 경우 "개인정보 처리 방법에 관한 고시(제2020-7호)" 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
    
    ④ 개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제35조 제4항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.
    
    ⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.
    
    ⑥ ***멋쟁이사자처럼 명지대(자연)***  은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.
    
    **제4조(처리하는 개인정보의 항목 작성)**
    
    ① *< **멋쟁이사자처럼 명지대(자연)**   >*은(는) 다음의 개인정보 항목을 처리하고 있습니다.
    
    1 < 웹서비스 기능 개발에의 활용 >
    
    필수항목 : 이름, 전화번호, 이메일, 서비스 이용 기록, 접속 로그, 접속 IP 정보
    
    **제5조(개인정보의 파기)**
    
    ① < ***멋쟁이사자처럼 명지대(자연)***   > 은(는) 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.
    
    ② 정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.
    
    1. 법령 근거 :
    
    2. 보존하는 개인정보 항목 : 이름, 연락처
    
    ③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.
    
    1. 파기절차
    
    < ***멋쟁이사자처럼 명지대(자연)***   > 은(는) 파기 사유가 발생한 개인정보를 선정하고, < ***멋쟁이사자처럼 명지대(자연)***   > 의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.
    
    2. 파기방법
    
    전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다
    
    **제6조(개인정보의 안전성 확보 조치)**
    
    **< *멋쟁이사자처럼 명지대(자연)***   **>은(는) 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.**
    
    1. 정기적인 자체 감사 실시
    
    개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.
    
    2. 개인정보 취급 담당자의 최소화 및 교육
    
    개인정보를 취급하는 담당자를 지정하고 담당자에 한정시켜 최소화 하여 개인정보를 관리하는 대책을 시행하고 있습니다.
    
    3. 내부관리계획의 수립 및 시행
    
    개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.
    
    4. 해킹 등에 대비한 기술적 대책
    
    <***멋쟁이사자처럼 명지대(자연)***  > 은 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.
    
    5. 개인정보의 암호화
    
    이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.
    
    6. 접속기록의 보관 및 위변조 방지
    
    개인정보처리시스템에 접속한 기록을 최소 1년 이상 보관, 관리하고 있으며,다만, 5만명 이상의 정보주체에 관하여 개인정보를 추가하거나, 고유식별정보 또는 민감정보를 처리하는 경우에는 2년이상 보관, 관리하고 있습니다.
    
    또한, 접속기록이 위변조 및 도난, 분실되지 않도록 보안기능을 사용하고 있습니다.
    
    7. 개인정보에 대한 접근 제한
    
    개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.
    
    8. 문서보안을 위한 잠금장치 사용
    
    개인정보가 포함된 서류, 보조저장매체 등을 잠금장치가 있는 안전한 장소에 보관하고 있습니다.
    
    **제7조 (개인정보 보호책임자)**
    
    ① ***멋쟁이사자처럼 명지대(자연)***   은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
    
    **개인정보 보호책임자**
    
    성명 : **임학수**
    
    직책 : ***멋쟁이사자처럼 명지대(자연) 11기 대표***
    
    연락처 : [harksulim@naver.com](mailto:harksulim@naver.com) 
    
    CS 채널: 웹페이지 하단 채널톡 참조
    
    ② 정보주체께서는 ***멋쟁이사자처럼 명지대(자연)***   의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. ***멋쟁이사자처럼 명지대(자연)***  은(는) 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.
    
    **제8조(개인정보 열람청구)**
    
    **정보주체는 ｢개인정보 보호법｣ 제35조에 따른 개인정보의 열람 청구를 아래의 부서에 할 수 있습니다.**
    
    **< *멋쟁이사자처럼 명지대(자연)*  >은(는) 정보주체의 개인정보 열람청구가 신속하게 처리되도록 노력하겠습니다.**
    
    성명 : **임학수**
    
    직책 : ***멋쟁이사자처럼 명지대(자연)**  **11기 대표***
    
    연락처 : [harksulim@naver.com](mailto:harksulim@naver.com)
    
    **제9조(권익침해 구제방법)**
    
    정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.
    
    1. 개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)
    
    2. 개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)
    
    3. 대검찰청 : (국번없이) 1301 (www.spo.go.kr)
    
    4. 경찰청 : (국번없이) 182 (ecrm.cyber.go.kr)
    
    「개인정보보호법」제35조(개인정보의 열람), 제36조(개인정보의 정정·삭제), 제37조(개인정보의 처리정지 등)의 규정에 의한 요구에 대 하여 공공기관의 장이 행한 처분 또는 부작위로 인하여 권리 또는 이익의 침해를 받은 자는 행정심판법이 정하는 바에 따라 행정심판을 청구할 수 있습니다.
    
    ※ 행정심판에 대해 자세한 사항은 중앙행정심판위원회(www.simpan.go.kr) 홈페이지를 참고하시기 바랍니다.
    
    **제10조(개인정보 처리방침 변경)**
    
    ① 이 개인정보처리방침은 2022년 3월 1일 부터 적용됩니다.`,
};

export const Questions = {
  common: [
    {
      question:
        '저희 멋쟁이사자처럼 11기에 지원해 주심에 감사드리며, 지원자분의 지원 동기를 올해의 목표와 연관 지어 서술해 주세요.',
      maxLength: 1000,
      part: 'common',
    },
    {
      question:
        '나의 한계점을 극복하기 위해 노력하여 달성해본 경험을 문제-과정(노력)-목표달성의 이야기로 서술해주세요.',
      maxLength: 1000,
      part: 'common',
    },
  ],
  web: [
    {
      question:
        '이번 멋쟁이사자처럼 11기 활동을 통해서 얻어가고 싶은것을 말씀해주세요.',
      maxLength: 1000,
      part: 'web',
    },
    {
      question:
        '웹개발자의 입장에서 평소에 사용하는 서비스에서 개선하면 좋겠다고 생각했던 점이 있다면 말씀해주세요.',
      maxLength: 700,
      part: 'web',
    },
    {
      question:
        '왜 프론트엔드 파트를 선택하게 되었고 본인이 생각하는 프로젝트 내에서 프론트엔드 파트의 역할을 말씀해주세요.',
      maxLength: 700,
      part: 'web',
    },
  ],
  server: [
    {
      question:
        '이번 멋쟁이사자처럼 11기 활동을 통해서 얻어가고 싶은것을 말씀해주세요.',
      maxLength: 1000,
      part: 'server',
    },
    {
      question:
        '여태까지 지원자가 웹 개발(프론트엔드, 백엔드, 앱 등등)에 대해 공부했던 경험이나 프로젝트 진행 경험을 서술해주세요.',
      maxLength: 700,
      part: 'server',
    },
    {
      question:
        '지금까지 학교 공부 이외에 지원자 스스로 몰입하여 달성해본 경험이 있다면 자세히 서술해주세요. 참고할만한 자료가 있다면 링크를 걸어주셔도 좋습니다. 개발 경험이 아니여도 좋습니다.',
      maxLength: 1000,
      part: 'server',
    },
  ],
  desgin: [
    {
      question:
        '본인이 하루에 1번은 꼭 접속하는 웹/앱 서비스 한 가지를 설명해주시고, 장단점을 작성해주세요.',
      maxLength: 1000,
      part: 'design',
    },
    {
      question:
        '본인에게 가장 어려웠던 팀프로젝트와 그 이유를 서술하고, 이를 극복하는 과정에서 배운 점을 디자인 파트와 관련지어 작성해주세요.',
      maxLength: 1000,
      part: 'design',
    },
  ],
};
